Revit 2024 API
TessellatedBuildIssue.GetIssueDescription Method
 Gets a string describing the issue. If the issue does not present a problem, then an empty string is returned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public string GetIssueDescription()
Visual Basic
Public Function GetIssueDescription As String
Visual C++
public:
String^ GetIssueDescription()
Return Value
 Description of the issue.
See Also
TessellatedBuildIssue Class
Autodesk.Revit.DB Namespace